Repository: flaretothewin/app_icon_tools
Catalog: lib/l10n/intl_*.arb
Languages: cs, ru, sk

# locale
source: en
cs: cs
ru: ru
sk: sk

# appName
source: Launcher Icons Preview
cs: Nástroje ikony aplikace
ru: Инструменты иконки приложения
sk: Nástroje ikonky aplikácie

source: Save
cs: Uložit
ru: Сохранить
sk: Uložiť

source: Cancel
cs: Zrušit
ru: Отменить
sk: Zrušiť

source: Done
cs: Hotovo
ru: Готово
sk: Hotovo

source: Settings
cs: Nastavení
ru: Настройки
sk: Nastavenie

# dark
source: Dark Mode
cs: Temný režim
ru: Темный режим
sk: Temný režim

# restart
source: App restart required
cs: Je vyžadován restart aplikace
ru: Требуется перезапуск приложения
sk: Je vyžadovaný reštart aplikácie

# cupertino
source: iOS-style UI
cs: UI ve stylu iOS
ru: UI в стиле iOS
sk: UI v štýle iOS

# dragAndDropHere
source: Drop your image here or
cs: Sem přetáhněte obrázek nebo
ru: Перетащите иконку сюда или
sk: Sem pretiahnite obrázok alebo

# select
source: Please select your image:
cs: Vyberte prosím svůj obrázek
ru: Выберите вашу иконку:
sk: Vyberte si prosím obrázok

# wrongFile
source: File doesn't meet the Requirements
cs: Soubor nesplňuje požadavky
ru: Файл не соответствует требованиям
sk: Súbor nespĺňa požiadavky

source: Browse
cs: Procházet
ru: Выбрать
sk: Prechádzať

# iconAttributes
source: Launcher Icon Requirements:
cs: Požadavky na ikonu aplikace:
ru: Требования к иконке:
sk: Požiadavky na ikonu aplikácie:

source: File format:
cs: Formát souboru:
ru: Формат:
sk: Formát:

# imageSize
source: Dimensions:
cs: Rozměry:
ru: Размеры:
sk: Rozmery:

# maxKB
source: Max. file size:
cs: Max. velikost souboru:
ru: Файл до:
sk: Súbor do:

source: Color profile:
cs: Barevný profil:
ru: Профиль:
sk: Profil:

# noInterlacing
source: w/o interlacing.
cs: bez prokládání.
ru: без чересстрочности.
sk: bez prekladania.

# addBackground
source: Adaptive icon can be set up in the next step.
cs: V dalším kroku lze nastavit adaptivní ikonu.
ru: Адаптивные иконки настраиваются дальше.
sk: V ďalšom kroku je možné nastaviť adaptívne ikonky.

# storeRequirement
source: Technical requirements. Press for more info.
cs: Technické požadavky. Stisknutím zobrazíte další info.
ru: Технические требования.
sk: Technické požiadavky. Stlačením zobrazíte ďalšie info.

# backButton
source: Back
cs: Zpět
ru: Назад
sk: Späť

# saveAsZip
source: Export icons as ZIP archive
cs: Exportujte ikony jako archiv ZIP
ru: Экспорт иконок в виде ZIP архива
sk: Exportujte ikonky ako archív ZIP

# about
source: About this app
cs: O této aplikaci
ru: Об этом приложении
sk: O tejto aplikácii

# appSettings
source: UI Settings
cs: Nastavení uživatelského rozhraní
ru: Настройки пользовательского интерфейса
sk: Nastavenia užívateľského rozhrania

# choosePlatforms
source: Choose platforms for export
cs: Vyberte platformy pro export
ru: Выберите платформы для экспорта
sk: Vyberte platformy pre export

# previewShapes
source: Preview possible shapes
cs: Náhled možných tvarů
ru: Просмотр возможных форм
sk: Náhľad možných tvarov

# pwaColor
source: Select PWA Background color
cs: Vyberte barvu pozadí PWA
ru: Выберите цвет фона PWA
sk: Vyberte farbu pozadia PWA

# operatingSystem
source: Icon for OS:
cs: Ikona pro OS:
ru: Иконка для ОС:
sk: Ikona pre OS:

# lookOnDevice
source: Zoom to check {platform} icon
cs: Prohlédněte si ikonu {platform} zblízka přiblížením
ru: Увеличьте, чтобы проверить {platform} иконку
sk: Prezrite si ikonu {platform} zblízka priblížením

source: Icon Preview
cs: Náhled ikonky
ru: Предварительный просмотр иконки
sk: Náhľad ikonky

# uploadAdaptiveBg
source: Select Adaptive Background
cs: Vyberte Adaptivní pozadí
ru: Выберите фон
sk: Vyberte Adaptívné pozadie

# uploadAdaptiveFg
source: Select Adaptive Foreground
cs: Vyberte Adaptivní popředí
ru: Выберите передний план
sk: Vyberte Adaptívné popredie

source: Remove Color
cs: Odebrat barvu
ru: Удалить цвет
sk: Odobrať farbu

source: Remove Background
cs: Odebrat pozadí
ru: Удалить фон
sk: Odobrať pozadie

source: Remove Foreground
cs: Odebrat popředí
ru: Удалить передний план
sk: Odobrať popredie

# iconBgColor
source: Preview possible background color
cs: Náhled možné barvy pozadí
ru: Предварительный просмотр фона
sk: Náhľad možné farby pozadia

# noBackground
source: Please select background image first.
cs: Nejprve vyberte pozadí / popředí.
ru: Пожалуйста, сначала выберите фон/передний план
sk: Najprv vyberte pozadie / popredie.

# parallax
source: Preview Adaptive Icon parallax effect.
cs: Náhled efektu parallax Adaptivní ikonky.
ru: Предварительный просмотр эффекта параллакса Адаптивных иконок
sk: Náhľad efektu Parallax Adaptívne ikonky.

source: Device Preview
cs: Náhled na zařízení
ru: На устройстве
sk: Náhľad na zariadení

# export
source: Export Icons
cs: Exportovat ikony
ru: Экспорт иконок
sk: Exportovať ikonky

# wait
source: Please wait a moment.
cs: Prosím, počkejte chvíli.
ru: Пожалуйста, подождите минутку.
sk: Prosím, počkajte chvíľu.

# colorAsBg
source: Background as color
cs: Pozadí jako barva
ru: Фон в виде цвета
sk: Pozadie ako farba

# exportPlatforms
source: Platforms to Export
cs: Platformy k exportu
ru: Платформы на экспорт
sk: Platformy k exportu

# longPress
source: Long press to remove!
cs: Dlouhým stisknutím jej odstraníte!
ru: Нажмите и удерживайте, чтобы удалить!
sk: Dlhým stlačením to odstránite!

# verifying
source: Wait please, the file is being verified.
cs: Počkejte prosím, soubor se ověřuje.
ru: Подождите пожалуйста, файл проверяется.
sk: Počkajte, súbor sa overuje.

source: Regular Icon:
cs: Obyčejná ikona:
ru: Обычная иконка:
sk: Obyčajná ikona:

source: Adaptive Foreground:
cs: Adaptivní popředí:
ru: Адаптивный передний план:
sk: Adaptívne popredie:

source: Adaptive Background:
cs: Adaptivní pozadí:
ru: Адаптивный фон:
sk: Adaptívne pozadie:

# tooSmall
source: !!! The image is smaller than required, the result Icon can be pixelized during upscaling.
cs: !!! Obrázek je menší, než je požadováno, výsledná ikona může být kvůli zvětšování pixelována.
ru: Изображение меньше, чем требуется, иконка на выходе может быть пикселизована во время масштабирования.
sk: Obrázok je menší, ako je požadované, výsledná ikona môže byť kvôli zväčšovaniu pixelována.

# tooHeavy
source: !! The file size is bigger than the limit. You may have trouble publishing it to app stores.
cs: !! Velikost souboru je větší než limit. Při publikování v obchodech aplikaci můžete mít potíže.
ru: Размер файла выше лимита. У вас могут возникнуть проблемы с публикацией его в магазинах приложений.
sk: Veľkosť súboru je väčšia ako limit. Pri publikovaní v obchodoch aplikácii môžete mať problémy.

# notSqaure
source: ! The image is not square. Icon can be deformed, or the edges of the trim can be visible.
cs: !Obrázek není čtvercový. Ikona může být zdeformovaná nebo mohou být viditelné okraje ořezu.
ru: Изображение не квадратное. Значок может быть деформирован, или края обрезки могут быть видны.
sk: Obrázok nie je štvorcový. Ikona môže byť zdeformovaná alebo môžu byť viditeľné okraje orezu.

# isTransparent
source: ℹ️ The image have Alpha Channel (transparency).
cs: ℹ️ Obrázek má alfa kanál (průhlednost).
ru: Изображение имеет Альфа-канал (прозрачность).
sk: Obrázok má alfa kanál (priehľadnosť).

# transparencyIOS
source: *iOS Launcher dоn't support transparency in any app Icon (including PWA). The Alpha channel will be replaced with black color.
cs: *Launcher iOS nepodporuje průhlednost v žádné ikoně aplikace (včetně PWA). Alpha kanál bude v systému iOS nahrazen černou barvou.
ru: *iOS лаунчер не поддерживает прозрачность в иконках приложениий (включая PWA). Альфа-канал будет заменен на черный цвет в iOS.
sk: Launcher iOS nepodporuje priehľadnosť v žiadnej ikone aplikácie (vrátane PWA). Alpha kanál bude v systéme iOS nahradený čiernou farbou.

# transparencyAdaptive
source: ℹ️ The Foreground have no Alpha Channel (transparency). In this case, the background image will not be visible at all.
cs: ℹ️ Popředí nemá žádný alfa kanál (průhlednost). V takovém případě nebude obrázek na pozadí vůbec viditelný.
ru: *На переднем плане нет Альфа-канала (прозрачность). В этом случае фоновое изображение не будет видно вообще.
sk: Popredie nemá žiadny alfa kanál (priehľadnosť). V takom prípade nebude obrázok na pozadí vôbec viditeľný.

source: Search
cs: Hledat
ru: Поиск
sk: Hľadať

# findLang
source: Find your language here…
cs: Najděte svůj jazyk zde…
ru: Найди здесь язык…
sk: Nájdite svoj jazyk tu…

# downloadsFolder
source: Done! Icons ZIP is in the Downloads folder.
cs: Hotovo! Ikony ZIP jsou ve složce Stažené soubory.
ru: Готово! Иконки ZIP находятся в папке Загрузок.
sk: Hotovo! Archív icons.ZIP je ve zložce Stiahnuté súbory.

# share
source: Done! You can share your icons with the world.
cs: Hotovo! Své ikony můžete sdílet se světem.
ru: Готово! Вы можете поделиться своими иконками.
sk: Hotovo! Svoje ikonky môžete zdieľať so svetom.
